brew "duckdb"
brew "eza"
brew "fd"
brew "gcc"
brew "gh"
brew "git"
brew "htop"
brew "sqlite"
brew "isort"
brew "lua"
brew "make"
brew "neovim"
brew "node"
brew "openblas"
brew "numpy"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "rustup"
brew "terminal-notifier"
brew "unzip"
brew "zsh"
cask "alt-tab"
cask "breaktimer"
cask "hiddenbar"
cask "itsycal"
cask "stats"
cask "visual-studio-code"
vscode "abusaidm.html-snippets"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "njpwerner.autodocstring"
vscode "pranaygp.vscode-css-peek"
vscode "tushortz.python-extended-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
